#+HTML_LINK_HOME: index.html
#+HTML_LINK_UP: index.html
#+title: /C Generics/
#+author: Jackson
#+date: 12/27/23
#+OPTIONS: toc:nil num:nil html-style:nil timestamp:nil
#+SETUPFILE: retro_dark.theme
#+HTML_HEAD: <link rel="preconnect" href="https://fonts.googleapis.com">
#+HTML_HEAD: <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
#+HTML_HEAD: <link href="https://fonts.googleapis.com/css2?family=Delicious+Handrawn&display=swap" rel="stylesheet">
#+HTML_HEAD: <style type="text/css">
#+HTML_HEAD: del{position:relative;text-decoration:line-through}del::after{content:"worse";position:absolute;top:50%;left:25px;transform:translate(-5%,-50%) rotate(-7deg);background-color:#f5f5f5;padding:0 7px 4px;font-size:18px;font-weight:700;border-radius:4px;z-index:1;box-shadow:2px 2px 5px rgba(0,0,0,.2);text-shadow:2px 2px 3px rgba(0,0,0,.3);line-height:1;scale:115%;background-image:linear-gradient(45deg,rgba(139,69,19,.4) 10%,rgba(139,69,19,.4) 20%,rgba(160,82,45,.4) 20%,rgba(160,82,45,.4) 30%,rgba(205,133,63,.4) 30%,rgba(205,133,63,.4) 40%,rgba(139,69,19,.4) 40%,rgba(139,69,19,.4) 50%,rgba(205,133,63,.4) 50%,rgba(205,133,63,.4) 70%,rgba(139,69,19,.4) 70%,rgba(139,69,19,.4) 80%,rgba(160,82,45,.4) 80%,rgba(160,82,45,.4) 90%,rgba(139,69,19,.4) 90%);background-size:100% 100%;background-position:0 0;color:#ff0000;font-family:'Delicious Handrawn',cursive;clip-path:polygon(0% 0%,8% 12%,5% 25%,10% 37%,2% 47%,9% 55%,0% 67%,7% 78%,3% 90%,0% 100%,100% 100%,97% 90%,93% 78%,100% 67%,91% 55%,98% 47%,90% 37%,95% 25%,92% 12%,100% 0%)}
#+HTML_HEAD: </style>


* _Introduction_
If you've coded in C for any amount of time you probably think that C doesn't have generics. After all, C++ clearly has generics, so if C did surely they would look the same, right?

Well, you are sort of right, and sort of wrong. See, C does not have generics in the regular sense, where the compiler will figure out which types you are using at compile time and generate the correct code for the generic function or data structure. C has =_Generic=, which is a compile time macro that chooses between a set list of options based on the type of the argument it was passed.

You may ask, how is this any different from an overloaded function? From what I can tell they're the exact same thing, with both choosing the correct path at compile time. Sounds simple enough, let's just use function overloading instead.

#+begin_src C :results raw
int add(int a, int b) {
  return a + b;
}

float add(float a, float b) {
  return a + b;
}

int main() {
  int i_result = add(2, 4);
  float f_result = add(2.0, 4.0);
}
#+end_src

#+begin_src c
12:7: error: conflicting types for ‘add’; have ‘float(float,  float)’
             12 | float add(float a, float b) {
                |       ^~~
8:5: note: previous definition of ‘add’ with type ‘int(int,  int)’
              8 | int add(int a, int b) {
                |     ^~~
#+end_src

Ohh... that didn't work.

As you may know, we don't have the ability to define overloaded functions in C. This example is small, but imagine having to call an entirely different ~min~ or ~max~ function for each different type of comparison, it would make your unecessarily large. We can fix this ~add~ example fairly easily.

#+begin_src C :exports both :results output
#include <stdio.h>
#define add(a, b)                               \
  _Generic((a),                                 \
           int: add_int,                        \
           double: add_double) (a,b)

int add_int(int a, int b) { return a + b; }
double add_double(double a, double b) { return a + b; }

int main() {
  int res_a = add(3, 4);
  double res_b = add(3.0, 4.0);
  printf("int: %d\n", res_a);
  printf("double: %f\n", res_b);
}
#+end_src

#+RESULTS:
: int: 6
: double: 6.000000

We will quickly break this down before we get in to more complicated implementations later.
1. ~#define add(a, b)~, we start by defining our macro named "add", which takes 2 parameters `a` and `b`
2. ~_Generic((a), int: add_int, double: add_double)~, this is our compile time "switch statement", which chooses the correct function based on the type of the first argument `a`
3. ~(a,b)~, the last block tells the compiler that we are passing the arguments `a` and `b` to the selected function

In this article we are going to take a look at a few example use cases where generics may help us write more concise code, that vastly simplifies our API.

* _Making a +better+ Print Function_
Any C programmer has learned to either love or hate ~printf~, I personally prefer it over a C++ ~ostream~, but as I've learned from other languages, there can an even easier way to print. In both ~javascript~ and ~vlang~ you can use the concept of /template literals/ ([[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals][mdn]], [[https://github.com/vlang/v/blob/master/doc/docs.md#println][vlang]]). Template literals allow the entire string to be defined at once, with each variable or expression residing within a ~${}~ block.

/js/
#+begin_src js :exports both :results output
const name = "John";
const age = 32
console.log(`Hi there my name is ${name} and I am ${age} years old.`)
#+end_src

#+RESULTS:
: Hi there my name is John and I am 32 years old.

/v/
#+begin_src go
name := "John"
age := 32
println('Hi there my name is ${name} and I am ${age} years old.')
#+end_src

#+begin_example
Hi there my name is John and I am 32 years old.
#+end_example

The ability to place variables inline with the rest of the string increases the speed of iteration, and avoids errors that may occur with a format specifier does not match its argument. It would be really nice if we had this in C, even if it just used for debugging and development.

Let's see how we can use ~_Generic~ to achieve a similar behavior to what we saw above.

